[Demo_Maya_ep4_1_ENG GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=2136,Y=-2193,Z=135),SecTime=)
DemoScripts[2]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=-90,Y=-5,Z=0),SecTime=)
DemoScripts[3]=(Actor=CHARACTER,Command=POP,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Vec=(X=2136,Y=-2383,Z=0),VecSub=(X=90,Y=0,Z=0),CId=71)
DemoScripts[4]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[5]=(Actor=CHARACTER,Command=POP,Name="ホーダイ君人形",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',Vec=(X=2136,Y=-2353,Z=80),VecSub=(X=90,Y=0,Z=0),CId=258)
DemoScripts[6]=(Actor=CHARACTER,Command=ACTION,Name="ホーダイ君人形",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',motionName[0]="hd_DM_0100_lp_Stand",Number=9,CId=258,Bit=4)
DemoScripts[7]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0000_lp_open_normal",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[8]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_CMN_Positive.GG2_BGM_DM_CMN_Positive_Cue')
DemoScripts[9]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Campus_2.GG2_AMB_Campus_2_LP_Cue')
DemoScripts[10]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[11]=(Actor=FADE,Command=WAIT)
DemoScripts[12]=(Actor=WINDOW,Command=SET)
DemoScripts[13]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep4_1.GG2_V_Maya_ep4_1_001_Cue',Name="エコロ")
DemoScripts[14]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[15]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[16]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[17]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0001_lp_open_angry",Rate=0,Number=0,Bit=1)
DemoScripts[18]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep4_1.GG2_V_Maya_ep4_1_003_Cue',Name="エコロ")
DemoScripts[19]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[20]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[21]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[22]=(Actor=WINDOW,Command=EXIT)
DemoScripts[23]=(Actor=BGM,Command=STOP,SecTime=1,SoundID=)
DemoScripts[24]=(Actor=CAMERA,Command=MOVE,SetType=ROT,Vec=(X=-90,Y=-35,Z=0),SecTime=0.5)
DemoScripts[25]=(Actor=SYSTEM,Command=WAIT,SecTime=0.5)
DemoScripts[26]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=-90,Y=-35,Z=0),SecTime=)
DemoScripts[27]=(Actor=SYSTEM,Command=WAIT,SecTime=0.5)
DemoScripts[28]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_CMN_Uneasy.GG2_BGM_DM_CMN_Uneasy_Cue')
DemoScripts[29]=(Actor=WINDOW,Command=SET)
DemoScripts[30]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep4_1.GG2_V_Maya_ep4_1_005_Cue',Name="エコロ")
DemoScripts[31]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[32]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[33]=(Actor=WINDOW,Command=EXIT)
DemoScripts[34]=(Actor=CAMERA,Command=MOVE,SetType=POS,Vec=(X=2136,Y=-2213,Z=80),SecTime=0.3)
DemoScripts[35]=(Actor=CAMERA,Command=MOVE,SetType=ROT,Vec=(X=-90,Y=-27,Z=0),SecTime=0.3)
DemoScripts[36]=(Actor=SYSTEM,Command=WAIT,SecTime=0.3)
DemoScripts[37]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=2136,Y=-2213,Z=80),SecTime=)
DemoScripts[38]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=-90,Y=-27,Z=0),SecTime=)
DemoScripts[39]=(Actor=CHARACTER,Command=ACTION,Name="ホーダイ君人形",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',motionName[0]="hd_DM_0102_fx_Stand2Talk",Number=9,CId=258,Bit=0)
DemoScripts[40]=(Actor=CHARACTER,Command=ACTION,Name="ホーダイ君人形",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',motionName[0]="hd_DM_0200_lp_Talk",Number=10,CId=258)
DemoScripts[41]=(Actor=WINDOW,Command=SET)
DemoScripts[42]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep4_1.GG2_V_Maya_ep4_1_006_Cue',Name="")
DemoScripts[43]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[44]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[45]=(Actor=CHARACTER,Command=ACTION,Name="ホーダイ君人形",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',motionName[0]="hd_DM_0201_fx_Talk2Stand",Number=9,CId=258,Bit=0)
DemoScripts[46]=(Actor=CHARACTER,Command=ACTION,Name="ホーダイ君人形",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',motionName[0]="hd_DM_0100_lp_Stand",Number=10,CId=258)
DemoScripts[47]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[48]=(Actor=CHARACTER,Command=ACTION,Name="ホーダイ君人形",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',motionName[0]="hd_DM_0102_fx_Stand2Talk",Number=9,CId=258,Bit=0)
DemoScripts[49]=(Actor=CHARACTER,Command=ACTION,Name="ホーダイ君人形",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',motionName[0]="hd_DM_0200_lp_Talk",Number=10,CId=258)
DemoScripts[50]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep4_1.GG2_V_Maya_ep4_1_008_Cue',Name="")
DemoScripts[51]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[52]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[53]=(Actor=CHARACTER,Command=ACTION,Name="ホーダイ君人形",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',motionName[0]="hd_DM_0201_fx_Talk2Stand",Number=9,CId=258,Bit=0)
DemoScripts[54]=(Actor=CHARACTER,Command=ACTION,Name="ホーダイ君人形",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',motionName[0]="hd_DM_0100_lp_Stand",Number=10,CId=258)
DemoScripts[55]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep4_1.GG2_V_Maya_ep4_1_009_Cue',Name="エコロ")
DemoScripts[56]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[57]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[58]=(Actor=TEXT,Command=SET,ID=TEXT10)
DemoScripts[59]=(Actor=WINDOW,Command=EXIT)
DemoScripts[60]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[61]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[62]=(Actor=AMBIENT,Command=STOP,SecTime=2,SoundID=)
DemoScripts[63]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[64]=(Actor=SYSTEM,Command=END)

[Select_Maya_ep4_1_ENG GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=STUDY,ParamNum=50),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=SPORT,ParamNum=55),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=FASHION,ParamNum=50),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=EROTIC,ParamNum=50))
Selects[1]=(Label="SELECT01",SelectNumber=4,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=STUDY,ParamNum=50),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=SPORT,ParamNum=55),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=FASHION,ParamNum=50),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=EROTIC,ParamNum=50))
Selects[2]=(Label="SELECT02",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=STUDY,ParamNum=50),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=SPORT,ParamNum=55),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=FASHION,ParamNum=50),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=EROTIC,ParamNum=50))

[Text_Maya_ep4_1_ENG GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="艾可蘿",Text="不過還真令我驚訝./n照那口氣來看,真夜大人似乎/n非常精通惡魔的事情呢.")

Texts[1]=(Label="TEXT02",Name="峯大",Text="啊啊,妳是指考試補習的事?")

Texts[2]=(Label="TEXT03",Name="艾可蘿",Text="是的./n這也和我從女神大人那裡聽說的情報一致.")

Texts[3]=(Label="TEXT04",Name="峯大",Text="哦~小真夜身上也有/n許多謎團啊......咦......?")

Texts[4]=(Label="TEXT05",Name="艾可蘿",Text="是真夜大人的傳訊人偶呢./n有什麼事情嗎?")

Texts[5]=(Label="TEXT06",Name="峯大小子",Text="\"快點快點!/n小真夜陷入危機了!\"")

Texts[6]=(Label="TEXT07",Name="峯大",Text="咦咦!? 那就不妙了!/n小真夜在哪裡!?")

Texts[7]=(Label="TEXT08",Name="峯大小子",Text="\"求救! 求救!/n趕快! 趕快!\"")

Texts[8]=(Label="TEXT09",Name="艾可蘿",Text="看來是不行呢....../n這下恐怕只能靠自己尋找了.")

Texts[9]=(Label="TEXT10",Name="峯大",Text="我們趕快開始吧!")

Texts[10]=(Label="",Name="",Text="")


